simmsb/tyrfing/vendor/avr-device/svd/attiny1616.svd
        <register>
          <name>ASYNCCH3</name>
          <description>Asynchronous Channel 3 Generator Selection</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCCH3</name>
              <description>Asynchronous Channel 3 Generator Selection</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable custom logic LUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable custom logic LUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 out</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBCLR</name>
                  <description>Timer/Counter type D compare B clear</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPASET</name>
                  <description>Timer/Counter type D compare A set</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_CMPBSET</name>
                  <description>Timer/Counter type D compare B set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCD0_PROGEV</name>
                  <description>Timer/Counter type D program event</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter overflow</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter compare</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV8192</name>
                  <description>Periodic Interrupt CLK_RTC div 8192</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV4096</name>
                  <description>Periodic Interrupt CLK_RTC div 4096</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV2048</name>
                  <description>Periodic Interrupt CLK_RTC div 2048</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV1024</name>
                  <description>Periodic Interrupt CLK_RTC div 1024</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV512</name>
                  <description>Periodic Interrupt CLK_RTC div 512</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV256</name>
                  <description>Periodic Interrupt CLK_RTC div 256</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV128</name>
                  <description>Periodic Interrupt CLK_RTC div 128</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT_DIV64</name>
                  <description>Periodic Interrupt CLK_RTC div 64</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC1_OUT</name>
                  <description>Analog Comparator 1 out</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC2_OUT</name>
                  <description>Analog Comparator 2 out</description>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCSTROBE</name>
          <description>Asynchronous Channel Strobe</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>write-only</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ASYNCUSER0</name>
          <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER0</name>
              <description>Asynchronous User Ch 0 Input Selection - TCB0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER1</name>
          <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER1</name>
              <description>Asynchronous User Ch 1 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER10</name>
          <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER10</name>
              <description>Asynchronous User Ch 10 Input Selection - Event Out 2</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER11</name>
          <description>Asynchronous User Ch 11 Input Selection - TCB1</description>
          <addressOffset>0x1D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER11</name>
              <description>Asynchronous User Ch 11 Input Selection - TCB1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER12</name>
          <description>Asynchronous User Ch 12 Input Selection - ADC1</description>
          <addressOffset>0x1E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER12</name>
              <description>Asynchronous User Ch 12 Input Selection - ADC0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER2</name>
          <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
          <addressOffset>0x14</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER2</name>
              <description>Asynchronous User Ch 2 Input Selection - CCL LUT0 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER3</name>
          <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
          <addressOffset>0x15</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER3</name>
              <description>Asynchronous User Ch 3 Input Selection - CCL LUT1 Event 0</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNCUSER4</name>
          <description>Asynchronous User Ch 4 Input Selection - CCL LUT0 Event 1</description>
          <addressOffset>0x16</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ASYNCUSER4</name>
              <description>Asynchronous User Ch 4 Input Selection - CCL LUT0 Event 1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH0</name>
                  <description>Synchronous Event Channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCCH1</name>
                  <description>Synchronous Event Channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH0</name>
                  <description>Asynchronous Event Channel 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH1</name>
                  <description>Asynchronous Event Channel 1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH2</name>
                  <description>Asynchronous Event Channel 2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCCH3</name>
                  <description>Asynchronous Event Channel 3</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
